{"title":"Dr. Snake","releaseDate":"2018-04-24T00:00:00.000Z","weight":2,"cover":"games-static/dr-snake/cover.png","draft":false,"slug":"dr-snake","html":"<p>I created Dr. Snake for Ludum Dare 41 in 48 hours. The theme was <strong>Combine 2 Incompatible Genres</strong>. I decided to combine snake, a topdown game with Dr. Mario, a game you look at from the side with gravity. The goal of the game is to remove all circles from the level by matching 3 or more snake body parts of the same color horizontally or vertically with the circle of that color.</p>\n<p>While the snake moves it works as a top down game, you can go in any direction. As soon as you hit something the snake keeps it shape and falls down like in Dr. Mario and stops when any of the parts hit something. If you match 4 or more of the same color those parts get removed. If this breaks the snake it breaks into separate parts that fall independently. You can play it <a href=\"https://codescapade.github.io/LD41/\" target=\"_blank\" rel=\"noopener\">here</a>.</p>\n<p><img src=\"games-static/dr-snake/screenshot-1.png\" alt=\"screenshot-1\"></p>\n<h3>Development</h3>\n<p>I used <a href=\"https://phaser.io/download/phaserce\" target=\"_blank\" rel=\"noopener\">Phaser CE</a> with TypeScript as framework for this game. Phaser is very easy to use and fast to prototype with. I use TypeScript at work so this was very useful to create a game in a small amount of time. Since it is a web framework it is easy to make your game available for people to play and judge.</p>\n<p>I might create a full game out of this at a later point. Seems it could be a fun mobile game. I would probably switch to a different framework then because WebGL is not a great option for mobile.</p>\n<p><img src=\"games-static/dr-snake/screenshot-2.png\" alt=\"screenshot-2\"></p>\n","excerpt":"I created Dr. Snake for Ludum Dare 41 in 48 hours. The theme was <strong>Combine 2 Incompatible Genres</strong>. I decided to combine snake, a topdown...","displaydate":"2018-04-24"}